WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/commands/hcom_nx_ex_flash.c
  _mtd->ioctl(_mtd, MTDIOC_GEOMETRY, (unsigned long)((uintptr_t) &geo));
  return(geo.blocksize);
}

/****************************************************************************
 * Name: hcom_nx_exec_ex_flash_get_erase_block_size
 *
 * Description:
 *  Get the erase blocksize for the flash memory.
 *
 * Input Parameters:
 *  None.
 *
 * Returned Value:
 *  Size of the erase block for the current flash memory.
 * 
 * Assumptions/Limitations:
 *  _mtd is set for the current flash driver.
 *
 ****************************************************************************/
uint32_t hcom_nx_exec_ex_flash_get_erase_block_size(void)
{
  struct mtd_geometry_s geo;

  _mtd->ioctl(_mtd, MTDIOC_GEOMETRY, (unsigned long)((uintptr_t) &geo));
  return(geo.erasesize);
}

/****************************************************************************
 * Name: hcom_nx_exec_ex_flash_get_geometry
 *
 * Description:
 *  Get a pointer to the geometry structure for the flash memory.
 *
 * Input Parameters:
 *  None.
 *
 * Returned Value:
 *  OK if successful, -1 otherwise.
 *
 * Assumptions/Limitations:
 *  _mtd is set for the current flash driver.
 *
 ****************************************************************************/
int hcom_nx_exec_ex_flash_get_geometry(struct mtd_geometry_s *geometry)
{
  int result = OK;

  if (geometry != NULL)
  {
    if (_mtd->ioctl(_mtd, MTDIOC_GEOMETRY, (unsigned long)((uintptr_t) geometry)) != 0)
    {
      result = -1;
    }
  }

  return(result);
}

/****************************************************************************
 * Name: hcom_nx_exec_ex_flash_read_absolute_block
 *
 * Description:
 *  Read a block from flash memory.
 *
 * Input Parameters:
 *  blockNumber - The block number to read.
 *  destinationAddress - Address in memory to place the data from the flash 
 *                       memory.
 *
 * Returned Value:
 *  OK
 *
 * Assumptions/Limitations:
 *  _mtd is set for the current flash driver.
 *
 ****************************************************************************/
int hcom_nx_exec_ex_flash_read_absolute_block(uint32_t blockNumber, void *destinationAddress)
{
  MTD_BREAD(_mtd, blockNumber, 1, destinationAddress);
  return OK;
}

/****************************************************************************
 * Name: hcom_nx_exec_ex_flash_copy_blocks_to_memory
 *
 * Description:
 *  Read a number of blocks from flash memory into a data buffer.
 * 
 *  The data is read twice, once into the destination buffer and then
 *  a second time into a local buffer for verification against the first
 *  read operation.
 *
 * Input Parameters:
 *  startBlock - The block number to start reading from.
 *  destinationAddress - Address in memory to place the data from the flash.
 *  numberOfBlocks - The number of blocks to read.
 *
 * Returned Value:
 *  OK on success, -1 if the data cannot be verified or if the data fails
 *  verification.
 *
 * Assumptions/Limitations:
 *  _mtd is set for the current flash driver.
 *  The destinationAddress must have enough space to hold the data.
 *
 ****************************************************************************/
// #pragma GCC optimize("O0")
int hcom_nx_exec_ex_flash_copy_blocks_to_memory(uint32_t startBlock, void *destinationAddress, uint32_t numberOfBlocks)
{
  uint32_t currentBlock = startBlock;
  uint32_t blocksRemaining = numberOfBlocks;
  void *destination = destinationAddress;
  uint32_t blockSize = hcom_nx_exec_ex_flash_get_block_size();
  int result = OK;

  while (blocksRemaining > 0)
  {
    MTD_BREAD(_mtd, currentBlock, 1, destination);
    currentBlock++;
    destination += blockSize;
    blocksRemaining--;
  }
  //
  //  Now verify the copy.
  //
  void *buffer = kmm_malloc(blockSize);
  if (buffer == NULL)
  {
    result = -1;
  }
  else
  {
    currentBlock = startBlock;
    blocksRemaining = numberOfBlocks;
    destination = destinationAddress;
    while (blocksRemaining > 0)
    {
      MTD_BREAD(_mtd, currentBlock, 1, buffer);
      if (memcmp(buffer, destination, blockSize) != 0)
      {
        result = -1;
        break;
      }
      currentBlock++;
      destination += blockSize;
      blocksRemaining--;
    }
    kmm_free(buffer);
  }

  return(result);
}

/****************************************************************************
 * Name: hcom_nx_exec_ex_flash_mono_flash
 *
 * Description:
 *  Copy the OS runtime binary into the correct location in flash memory.
 *
 * Input Parameters:
 *  cmdData - Pointer to the command data structure holding the parameters
 *           (arguments) from CLI.
 *
 * Returned Value:
 *  OK on success, -1 or negated errno on error.
 *
 * Assumptions/Limitations:
 *  _mtd is set for the current flash driver.
 *
 ****************************************************************************/
int hcom_nx_exec_ex_flash_mono_flash(struct hcom_nx_cmd_data *cmdData)
{
  int ret;
  cmdData->userData = 0;
  int lastPercentSent = 0;

  // Check for Mono runtime binary on filesystem.
#ifdef CONFIG_MTD_PARTITION
  const char runtimePath[] = "/meadow0/" HCOM_NX_FS_MONO_RUNTIME_FILENAME;
#else
  const char runtimePath[] = "/meadow/" HCOM_NX_FS_MONO_RUNTIME_FILENAME;
#endif

  int filefd = open(runtimePath, O_RDONLY);
  if (filefd == -1)
  {
    cmdData->logLevel = LOG_ERR;
    // Don't use snprintf_chk here
    cmdData->logLen = snprintf(cmdData->logMsg, HCOM_NX_CMD_LOG_MSG_SIZE,
            "%s@%d-Mono runtime was not found in %s.", thisFile, __LINE__,
            runtimePath);
    return -1;
  }

  struct stat fileStatus;
  ret = fstat(filefd, &fileStatus);
  if (ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-fstat of %s failed errno:%d\n",
           thisFile, __LINE__, runtimePath, errno);
    return -errno;
  }

  off_t fileSize = fileStatus.st_size;
  if (fileSize != HCOM_NX_FS_MONO_RAW_PARTITION_SIZE)
  {
    cmdData->logLevel = LOG_ERR;
    // Don't use snprintf_chk here
    cmdData->logLen = snprintf(cmdData->logMsg, HCOM_NX_CMD_LOG_MSG_SIZE,
            "%s@%d-Mono runtime binary has invalid size.", thisFile, __LINE__);
    return -1;
  }

  struct mtd_geometry_s geo;
  _mtd->ioctl(_mtd, MTDIOC_GEOMETRY, (unsigned long)((uintptr_t)&geo));

  const char monoEraseFlashMsg1[] = "Erasing mono flash memory\n";
  cmdData->send_host_msg(HCOM_HOST_REQUEST_TEXT_INFORMATION, 0,
          (char*)monoEraseFlashMsg1, thisFile, __LINE__);

