WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/commands/hcom_nx_ex_flash.c
  // This assumes that the space for Meadow.OS.Runtime.bin is the very first
  // thing in the external flash memory.
  size_t numBlocksToErase = fileSize / geo.erasesize;
  MTD_ERASE(_mtd, 0, numBlocksToErase);

  const char monoEraseFlashMsg2[] = "Mono memory erase success\n";
  cmdData->send_host_msg(HCOM_HOST_REQUEST_TEXT_INFORMATION, 0,
          (char*)monoEraseFlashMsg2, thisFile, __LINE__);

  uint8_t buf[geo.blocksize];
  uint8_t *verify = NULL;
  size_t numBlocksToWrite = fileSize / geo.blocksize;
  for (int i = 0; i < numBlocksToWrite; i++)
  {
    if (read(filefd, buf, geo.blocksize) < 0)
    {
      cmdData->logLevel = LOG_ERR;
      // Don't use snprintf_chk here
      cmdData->logLen = snprintf(cmdData->logMsg, HCOM_NX_CMD_LOG_MSG_SIZE,
              "%s@%d-Error reading from %s.\n", thisFile, __LINE__,
              HCOM_NX_FS_MONO_RUNTIME_FILENAME);
      goto cleanup;
    }

    ssize_t writtenBlocks = MTD_BWRITE(_mtd, i, 1, buf);
    if (writtenBlocks != 1)
    {
      cmdData->logLevel = LOG_ERR;
      // Don't use snprintf_chk here
      cmdData->logLen = snprintf(cmdData->logMsg, HCOM_NX_CMD_LOG_MSG_SIZE,
              "%s@%d-Error while writing block %d to flash.\n", thisFile, __LINE__, i);
      goto cleanup;
    }

    // 10%, 20% etc
    int percentDone = (i * 100) / numBlocksToWrite;
    if(percentDone / 10 != lastPercentSent)
    {
      char hostMsg[HCOM_NX_CMD_HOST_MSG_SIZE];
      lastPercentSent = percentDone / 10;

      snprintf_chk(hostMsg, HCOM_NX_CMD_HOST_MSG_SIZE, "Flashing %d%% complete", percentDone);
      cmdData->send_host_msg(HCOM_HOST_REQUEST_TEXT_INFORMATION, 0,
              hostMsg, thisFile, __LINE__);
    }
  }
  //
  //  Now lets verify what has been written.
  //
  if (lseek(filefd, 0, SEEK_SET) != 0)
  {
      cmdData->logLevel = LOG_ERR;
      // Don't use snprintf_chk here
      cmdData->logLen = snprintf(cmdData->logMsg, HCOM_NX_CMD_LOG_MSG_SIZE,
              "%s@%d-Error resetting file pointer for file %s.\n", thisFile, __LINE__,
              HCOM_NX_FS_MONO_RUNTIME_FILENAME);
      goto cleanup;
  }

  verify = malloc(geo.blocksize);
  if (verify == NULL)
  {
      cmdData->logLevel = LOG_ERR;
      // Don't use snprintf_chk here
      cmdData->logLen = snprintf(cmdData->logMsg, HCOM_NX_CMD_LOG_MSG_SIZE,
              "%s@%d-Error allocating memory for verification operation.\n", thisFile, __LINE__);
      goto cleanup;
  }

  const char monoStartingVerificationOperation[] = "Verifying runtime flash operation.\n";
  cmdData->send_host_msg(HCOM_HOST_REQUEST_TEXT_INFORMATION, 0,
          (char*)monoStartingVerificationOperation, thisFile, __LINE__);

  lastPercentSent = 0;
  for (int i = 0; i < numBlocksToWrite; i++)
  {
    if (read(filefd, buf, geo.blocksize) < 0)
    {
      cmdData->logLevel = LOG_ERR;
      // Don't use snprintf_chk here
      cmdData->logLen = snprintf(cmdData->logMsg, HCOM_NX_CMD_LOG_MSG_SIZE,
              "%s@%d-Error reading from %s.\n", thisFile, __LINE__,
              HCOM_NX_FS_MONO_RUNTIME_FILENAME);
      goto cleanup;
    }

    MTD_BREAD(_mtd, i, 1, verify);
    if (memcmp(buf, verify, geo.blocksize) != 0)
    {
      cmdData->logLevel = LOG_ERR;
      // Don't use snprintf_chk here
      cmdData->logLen = snprintf(cmdData->logMsg, HCOM_NX_CMD_LOG_MSG_SIZE,
              "%s@%d-Error verifying %s.\n", thisFile, __LINE__,
              HCOM_NX_FS_MONO_RUNTIME_FILENAME);
      goto cleanup;
    }

    // 10%, 20% etc
    int percentDone = (i * 100) / numBlocksToWrite;
    if(percentDone / 10 != lastPercentSent)
    {
      char hostMsg[HCOM_NX_CMD_HOST_MSG_SIZE];
      lastPercentSent = percentDone / 10;

      snprintf_chk(hostMsg, HCOM_NX_CMD_HOST_MSG_SIZE, "Verifying %d%% complete", percentDone);
      cmdData->send_host_msg(HCOM_HOST_REQUEST_TEXT_INFORMATION, 0,
              hostMsg, thisFile, __LINE__);
    }
  }
  free(verify);
  verify = NULL;

  const char monoSuccessFlashMsg[] = "Runtime flashed successfully\n";
  syslog(LOG_INFO, monoSuccessFlashMsg);
  cmdData->send_host_msg(HCOM_HOST_REQUEST_TEXT_INFORMATION, 0,
          (char*)monoSuccessFlashMsg, thisFile, __LINE__);

  cleanup:
    close(filefd);
    if (verify != NULL)
    {
      free(verify);
    }
    if(cmdData->logLevel != LOG_NONE)
    {
      if (cmdData->logLevel == LOG_ERR)
      {
        cmdData->send_host_msg(HCOM_HOST_REQUEST_TEXT_ERROR, 0, cmdData->logMsg, thisFile, __LINE__);
      }
      return -1;
    }
    return OK;
}

/****************************************************************************
 * Name: hcom_nx_exec_ex_flash_write_buffer_to_flash
 *
 * Description:
 *   Write the buffer of data to the specified location in flash.
 * 
 *   The data is written into flash one block at a time.  The data is then
 *   read back from flash into a temporary buffer and the original and the
 *   version from flash are then verified.
 *
 * Input Parameters:
 *   data_buf - Pointer to the data to be written to flash.
 *   size - Amount of data to write to flash.
 *   offset - Offset in flash to write the data.
 *
 * Returned Value:
 *  OK if successful, -1 if there was a problem.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
int  hcom_nx_exec_ex_flash_write_buffer_to_flash(uint8_t* data_buf, off_t size, off_t offset)
{
  struct hcom_nx_cmd_data *cmdData = NULL;
  struct mtd_geometry_s geo;
  _mtd->ioctl(_mtd, MTDIOC_GEOMETRY, (unsigned long)((uintptr_t)&geo));

  info("Erasing flash memory\n");

  int offsetInPages = offset / geo.blocksize;
  int offsetInEraseBlocks = offset / geo.erasesize;
  size_t numBlocksToWrite = size / geo.blocksize;
  size_t numBlocksToErase = size / geo.erasesize;
  int blockserased = MTD_ERASE(_mtd, offsetInEraseBlocks, numBlocksToErase);
  if (blockserased < 0)
  {
    return -1;
  }
  info("Erase success\n");

  uint8_t *buf = calloc(geo.blocksize, 1);

  for (int i = 0; i < numBlocksToWrite; i++)
    {
      memcpy(buf,data_buf, geo.blocksize);

      ssize_t writtenBlocks = MTD_BWRITE(_mtd, i + offsetInPages, 1, buf);
      if (writtenBlocks != 1)
      {
        error("Error while writing block %d to flash\n", i);
        free(buf);
        return -1;
      }

      // verify
      MTD_BREAD(_mtd, i + offsetInPages, 1, buf);
      if (memcmp(buf, data_buf, geo.blocksize) != 0)
      {
        syslog(LOG_ERR, "Error while verifying block %d.\n", i);
        free(buf);
        return -1;
      }
      data_buf+= geo.blocksize;
    }
  free(buf);

  return OK;
}

/****************************************************************************
 * Name: flash_file
 *
 * Description:
 *   Write the contents of the specified file into the location (offset) in
 *   flash.
 * 
 * Input Parameters:
 *   path - Path to the file to be written to flash.
 *   size - Amount of data to write to flash.
 *   offset - Offset in flash to write the data.
 *
 * Returned Value:
 *  OK if successful, -1 or -errno if there was a problem.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
static int flash_file(const char *path, off_t size, off_t offset)
{
  struct hcom_nx_cmd_data *cmdData = NULL;
  error("Flashing that file %s\n", path);
  int ret;

