WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/commands/hcom_nx_ex_flash.c
  int filefd = open(path, O_RDONLY);
  if (filefd == -1)
  {
    error("%s@%d-File not found: %s.\n", thisFile, __LINE__, path);
    return -1;
  }

  struct stat fileStatus;
  ret = fstat(filefd, &fileStatus);
  if (ret < 0)
  {
    error("%s@%d-fstat of %s failed errno:%d\n", thisFile, __LINE__, path, errno);
    return -errno;
  }

  off_t fileSize = fileStatus.st_size;
  if (fileSize != size)
  {
    error("File has invalid size. Expected %d, got %d\n", size, fileSize);
    return -1;
  }

  struct mtd_geometry_s geo;
  _mtd->ioctl(_mtd, MTDIOC_GEOMETRY, (unsigned long)((uintptr_t)&geo));

  info("Erasing flash memory\n");

  int offsetInEraseBlocks = offset / geo.erasesize;

  size_t numBlocksToErase = fileSize / geo.erasesize;
  int blockserased = MTD_ERASE(_mtd, offsetInEraseBlocks, numBlocksToErase);
  if (blockserased < 0)
  {
    return -1;
  }
  info("Erase success\n");

  uint8_t buf[geo.blocksize];
  size_t numBlocksToWrite = fileSize / geo.blocksize;
  size_t numBlocksToSkip = offset / geo.blocksize;
  for (int i = 0; i < numBlocksToWrite; i++)
  {
    if (read(filefd, buf, geo.blocksize) < 0)
    {
      error("Error reading from %s\n", path);
      goto cleanup;
    }

    ssize_t writtenBlocks = MTD_BWRITE(_mtd, i + numBlocksToSkip, 1, buf);
    if (writtenBlocks != 1)
    {
      error("Error while writing block %d to flash\n", i);
      goto cleanup;
    }

    // 10%, 20% etc
    int lastPercentSent = 0;
    int percentDone = (i * 100) / numBlocksToWrite;
    if (percentDone / 10 != lastPercentSent)
    {
      lastPercentSent = percentDone / 10;

      info("Flashing %d%% complete\n", percentDone);
    }

#define NUTTX_UPDATE_VERIFY 0
#if NUTTX_UPDATE_VERIFY > 0
    uint8_t verify[geo.blocksize];
    //
    //  Don't we need to add numBlocksToSkip here?
    //
    MTD_BREAD(_mtd, i, 1, verify);

    if (memcmp(buf, verify, geo.blocksize) != 0)
    {
      syslog(LOG_ERR, "Error while verifying block %d.\n", i);
      goto cleanup;
    }
#endif
  }
  info("Flash operation complete\n");
cleanup:
  close(filefd);
  // if(cmdData->logLevel != LOG_NONE)
  //   return -1;
  return OK;
}

// mirroring the individual flags in bootloader/Core/Inc/ota_data.h
typedef struct
{
  uint8_t update;
  uint8_t rollback;
  uint8_t backup_flag;
  uint8_t update_failure_flag;
  uint8_t rollback_failure;
  uint8_t backup_failure;
  uint8_t rollback_on_fail;
  uint8_t reserved[0x1000 - 7]; // min struct size = flash geo.erasesize
} OTAState;

/****************************************************************************
 * Name: hcom_nx_exec_ex_flash_OS_update_flash1
 *
 * Description:
 *   Part 1 update - AUpdate the operating system.
 * 
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *  OK if successful, -1 or -errno if there was a problem.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
int hcom_nx_exec_ex_flash_OS_update_flash1(void)
{
  int ret;
  OTAState state = {0};
  ret = flash_file(UPDATE_OS_DIR HCOM_NX_FS_NUTTX_UPDATE_FILENAME, HCOM_NX_FS_NUTTX_UPDATE_SIZE, HCOM_NX_FS_MONO_RAW_PARTITION_SIZE);
  if (ret)
    return ret;
  //
  //  Save the current OTA state to flash
  //
  state.update = 0x1;
  ret = hcom_nx_exec_ex_flash_write_buffer_to_flash((uint8_t*)&state, sizeof(OTAState), HCOM_NX_FS_MONO_RAW_PARTITION_SIZE + HCOM_NX_FS_NUTTX_UPDATE_SIZE);
  if (ret)
    return ret;
  ret = unlink(UPDATE_OS_DIR HCOM_NX_FS_NUTTX_UPDATE_FILENAME);
  if (ret)
    return ret;
  hcom_nx_common_utils_host_restart_meadow();
  return 0; // restarts; never actually returns
}

/****************************************************************************
 * Name: hcom_nx_exec_ex_flash_OS_update_flash2
 *
 * Description:
 *   Part 2 update - Update the runtime system.
 * 
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *  OK if successful, -1 or -errno if there was a problem.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
int hcom_nx_exec_ex_flash_OS_update_flash2(void)
{
  int ret;
  ret = flash_file(UPDATE_OS_DIR HCOM_NX_FS_MONO_RUNTIME_FILENAME, HCOM_NX_FS_MONO_RAW_PARTITION_SIZE, 0x0);
  if (ret)
    return ret;
  ret = unlink(UPDATE_OS_DIR HCOM_NX_FS_MONO_RUNTIME_FILENAME);
  if (ret)
    return ret;
  hcom_nx_common_utils_host_restart_meadow();
  return 0; // restarts; never actually returns
}

/****************************************************************************
 * Name: hcom_nx_exec_ex_flash_persistent_data_location
 *
 * Description:
 *   Get the location of the OS persistent data in flash memory.  This is one
 *   erase block past the start of the OtA data block.
 * 
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *  Location in flash of the OS persistent data.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
uint32_t hcom_nx_exec_ex_flash_persistent_data_location(void)
{
  uint32_t location = HCOM_NX_FS_MONO_RAW_PARTITION_SIZE + HCOM_NX_FS_NUTTX_UPDATE_SIZE;
  location += hcom_nx_exec_ex_flash_get_erase_block_size();
  return(location);
}

/****************************************************************************
 * Name: hcom_nx_exec_ex_flash_assert_data_location
 *
 * Description:
 *   Get the location of the assertion data from up_assert in flash memory.
 *   this is 2 erase block past the start of the OtA data block.
 * 
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *  Location in flash of the OS persistent data.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
uint32_t hcom_nx_exec_ex_flash_assert_data_location(void)
{
  uint32_t location = HCOM_NX_FS_MONO_RAW_PARTITION_SIZE + HCOM_NX_FS_NUTTX_UPDATE_SIZE;
  location += (2 * hcom_nx_exec_ex_flash_get_erase_block_size());
  return(location);
}

/****************************************************************************
 * Name: hcom_nx_exec_ex_flash_write_assertion_data
 *
 * Description:
 *   Write the assertion data to flash.
 * 
 * Input Parameters:
 *   data - pointer to the assertion data to be written to flash.
 *   length - amount of the data to be written.
 *
 * Returned Value:
 *  OK if successful, -1 or -errno if there was a problem.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
int hcom_nx_exec_ex_flash_write_assertion_data(const char *data, uint32_t length)
{
  int result;

  if (data == NULL)
  {
    result = -EINVAL;
  }
  else
  {
    uint32_t location = hcom_nx_exec_ex_flash_assert_data_location();
    off_t amount_to_write = length > HCOM_NX_MAXIMUM_ASSERTION_DATA_SIZE ? HCOM_NX_MAXIMUM_ASSERTION_DATA_SIZE : length;
    result = hcom_nx_exec_ex_flash_write_buffer_to_flash((uint8_t *) data, amount_to_write, location);
  }

  return(result);
}

/****************************************************************************
 * Name: hcom_nx_exec_ex_flash_read_assertion_data
 *
 * Description:
 *   Read the assertion data from the last call to up_assert from flash.
 * 
 * Input Parameters:
 *   data - Block of memory large enough to hold the assertion data.
 *
 * Returned Value:
 *  OK if successful, -1 or -errno if there was a problem.
 *
 * Assumptions/Limitations:
 *  data must be large enough to hold the assertion data.
 *
 ****************************************************************************/
int hcom_nx_exec_ex_flash_read_assertion_data(const char *data)
{
  int result = OK;

  if (data == NULL)
  {
    result = -EINVAL;
  }
  else
  {
    uint32_t location = hcom_nx_exec_ex_flash_assert_data_location();
    uint32_t pageLocation = location / hcom_nx_exec_ex_flash_get_block_size();
    size_t pagesToRead = HCOM_NX_MAXIMUM_ASSERTION_DATA_SIZE / hcom_nx_exec_ex_flash_get_block_size();
    
    size_t pagesRead = MTD_BREAD(_mtd, pageLocation, pagesToRead, data);
    if (pagesRead != pagesToRead)
    {
      result = -EIO;
    }
  }

  return(result);
}

#if (HCOM_NX_EX_FLASH_SHOW_FLASH_STATS > 0)
/****************************************************************************
 * Name: hcom_nx_exec_ex_flash_syslog_external_flash_regions
 *
 * Description:
 *   Mimicking the above code, to output, via syslog, the name, start and size
 *   of each of the external flash's non-file system regions. Also, output
 *   the available flash memory.
 * 
 *   Based on the above code this is the current use of the top 5MB of flash
 *   Runtime       - Size: 3145728 ( 3072 KB), Offset:0x00000000
 *   Meadow update - Size: 1835008 ( 1792 KB), Offset:0x00300000
 *   OTA State     - Size:    4096 (    4 KB), Offset:0x004c0000
 *   OS Persisted  - Size:    4096 (    4 KB), Offset:0x004c1000
 *   Assert Data   - Size:   32768 (   32 KB), Offset:0x004c2000
 *   Reserved      - Size:  221184 (  216 KB), Offset:0x004ca000
 *   File System   - Size:61865984 (60416 KB), Offset:0x00500000
 *
 * Input Parameters:
 *  none.
 *
 * Returned Value:
 *  none.
 *
 * Assumptions/Limitations:
 *  This function is executed before the flash chip is fully initialized.
 *  Therefore, the flash erase size is hard coded as 4096 (0x1000).
 *
 ****************************************************************************/
void hcom_nx_exec_ex_flash_syslog_external_flash_regions(FAR struct mtd_dev_s *mtd)
{
  uint32_t thisOffset = 0;
  uint32_t flashEraseSize;
  uint32_t totalReserved = (HCOM_NX_FS_MONO_RAW_PARTITION_SIZE + \
                       HCOM_NX_FS_OTA_RESERVED_SPACE);
  // uint32_t meadowVersion = meadow_hw_version_get();
  struct mtd_geometry_s geo;

  mtd->ioctl(mtd, MTDIOC_GEOMETRY, (unsigned long)((uintptr_t)&geo));
  
  flashEraseSize = geo.erasesize;

  // Segment 0 - Meadow.OS.Runtime.bin
  syslog(1, "Runtime       - Size:%8lu (%5lu KB), Offset:0x%08x\n",
            HCOM_NX_FS_MONO_RAW_PARTITION_SIZE,
            HCOM_NX_FS_MONO_RAW_PARTITION_SIZE/1024,
            thisOffset);

  // Segment 1 - Meadow.OS.Update.bin
  thisOffset += HCOM_NX_FS_MONO_RAW_PARTITION_SIZE;
  syslog(1, "Meadow update - Size:%8lu (%5lu KB), Offset:0x%08x\n",
            HCOM_NX_FS_NUTTX_UPDATE_SIZE,
            HCOM_NX_FS_NUTTX_UPDATE_SIZE/1024,
            thisOffset);

  // Segment 2 - OTAState
  thisOffset += HCOM_NX_FS_NUTTX_UPDATE_SIZE;
  syslog(1, "OTA State     - Size:%8lu (%5lu KB), Offset:0x%08x\n",
            sizeof(OTAState),
            sizeof(OTAState)/1024,
            thisOffset);

  // // Need the erase size. But, can't access flash chip for geo, because this
  // // function executes very early, before flash driver ready.
  // if(meadowVersion == MEADOW_F7_HW_VERSION_NUMB_UNKNOWN)
  //   return;
  
