WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/commands/hcom_nx_ex_flash.c
  // switch (meadowVersion)
  // {
  // case MEADOW_F7_HW_VERSION_NUMB_F7V1:
  //   flashEraseSize = MEADOW_F7_HW_VERSION_F7V1_ERASE_SIZE;
  //   break;
  // case MEADOW_F7_HW_VERSION_NUMB_F7V2:
  //   flashEraseSize = MEADOW_F7_HW_VERSION_F7V2_ERASE_SIZE;
  //   break;
  // case MEADOW_F7_HW_VERSION_NUMB_CCMV2:
  //   flashEraseSize = MEADOW_F7_HW_VERSION_CCMV2_ERASE_SIZE;
  //   break;
  
  // default:
  //   break;
  // }

  // Segment 3 - OS Persisted Data
  thisOffset += flashEraseSize;
  syslog(1, "OS Persisted  - Size:%8lu (%5lu KB), Offset:0x%08x\n",
          flashEraseSize,
          flashEraseSize/1024,
          thisOffset);

  // Segment 4 - Assert Data
  // See hcom_nx_exec_ex_flash_persistent_data_location();
  thisOffset += flashEraseSize;
  syslog(1, "Assert Data   - Size:%8lu (%5lu KB), Offset:0x%08x\n",
          HCOM_NX_MAXIMUM_ASSERTION_DATA_SIZE,
          HCOM_NX_MAXIMUM_ASSERTION_DATA_SIZE/1024,
          thisOffset);

  // Segment 5 - Unused flash space
  thisOffset += HCOM_NX_MAXIMUM_ASSERTION_DATA_SIZE;
  syslog(1, "Reserved      - Size:%8lu (%5lu KB), Offset:0x%08x\n",
          totalReserved - thisOffset,
          (totalReserved - thisOffset)/1024,
          thisOffset);
  
  // Segment 6 - available for file system
  // Get the flash chip size based on the hardware version
  int fileSystemSize = meadow_hw_version_flash_size() - totalReserved;
  thisOffset += (totalReserved - thisOffset);
  syslog(1, "File System   - Size:%8lu (%5lu KB), Offset:0x%08x\n",
          fileSystemSize,
          fileSystemSize/1024,
          thisOffset);
}
#endif
